app/views/surveys/employer.html.erb


  <% @survey.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."survey_id" = 1

          <%= f.fields_for :results do |f| %>
            <%= f.collection_select(:score, Answer.find(:all, :conditions => [ "question_id = ?", question.id ]), :value, :content ) %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 1