app/controllers/surveys_controller.rb

  def index
    @surveys = Survey.all
---
SELECT "surveys".* FROM "surveys"

  def show
    @survey = Survey.find(params[:id])
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @survey = Survey.new(params[:survey])
    if @survey.save
---
INSERT INTO "surveys" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 21 Sep 2013 13:39:27 UTC +00:00], ["name", "Test Algo 0.1"], ["updated_at", Sat, 21 Sep 2013 13:39:27 UTC +00:00]]

  def update
    @survey = Survey.find(params[:id])
    if @survey.update_attributes(params[:survey])
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "surveys" SET "name" = 'Test Algo 0.1-1', "updated_at" = '2013-09-21 15:46:48.638170' WHERE "surveys"."id" = 1

  def employer
    @survey = Survey.find(params[:id])
---
SELECT "surveys".* FROM "surveys" WHERE "surveys"."id" = ? LIMIT 1  [["id", "1"]]